OdRxProperty.subSetValue(OdRxObject*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Method called by setValue() to actually set the value. To be overloaded by the property implementation.
\returns eOk if the value is set successfully, or an appropriate error code otherwise.

OdRxProperty.subGetValue(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Method called by getValue() to actually get the value. To be overloaded by the property implementation.
\returns eOk if the value is returned successfully, or an appropriate error code otherwise.

OdRxProperty.setValue(OdRxObject*,OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the property value.
\param pO [in] The object which property to set.
\param value [in] Property value to set.
\returns eOk if the property value is set successfully, or an appropriate error code otherwise.
\remarks
If returns eNotApplicable, the property is considered read-only.

OdRxProperty.getValue(OdRxObject!System.Runtime.CompilerServices.IsConst*,OdRxValue*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Gets the property value.
\param pO [in] The object which property to retrieve.
\param value [out] Resulting value.
\returns eOk if the property value is returned successfully, or an appropriate error code otherwise.